def vv_ch(name):
    #ф-ция для ввода числа с проверкой
    while True:
        n=input(name)
        try:
            nn=int(n)
            if nn>0:
                return nn
            else:
                print("Ошибка. Введите целое число больше 0.")
        except:
            print("Ошибка. Введите целое число больше 0.")
def res(n):
    #ф-ция для формирования и вывода результата
    chisla = {
    '0': 'Ноль',
    '1': 'Один',
    '2': 'Два',
    '3': 'Три',
    '4': 'Четыре',
    '5': 'Пять',
    '6': 'Шесть',
    '7': 'Семь',
    '8': 'Восемь',
    '9': 'Девять',
    }
    res=[chisla[b] for b in str(n)]
    print(" ".join(res))
n=vv_ch("Введите число: ")
res(n)