#Задача 2.3
def vvc(name):
    '''ф-ция для ввода вещественного числа'''
    return float(input(f'{name}'))
def vt(name):
    '''ф-ция для ввода объема и темп. порции смеси'''
    print(f'порция смеси номер {name}')
    V=vvc('Введите объем порции смеси: ')
    T=vvc('введите температуру порции смеси: ')
    return [V,T]
def resv(v1,v2):
    '''нахождение итогового объема'''
    return v1+v2
def rest(v1,v2,t1,t2):
    '''нахождение итоговой температуры'''
    return (v1*t1+v2*t2)/(v1+v2)
def res(v1,v2,t1,t2):
    print('После объединения')
    print(f'{v1} литров воды температуры {t1}')
    print(f'и {v2} литров воды температуры {t2}')
    print(f'получим смесь {resv(v1,v2)} объема и {rest(v1,v2,t1,t2)} температуры.')
    
v1,t1=vt('1')
v2,t2=vt('2')
res(v1,v2,t1,t2)